app/controllers/points_controller.rb

SELECT "points".* FROM "points"
---
  def points_all
    @points = Point.all

SELECT  "points".* FROM "points" WHERE "points"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @oneUserPoints = Point.where(user_id: 1)