app/controllers/submissions_controller.rb

SELECT "submissions".* FROM "submissions"
---
  def index
    @submissions = Submission.all